platformio/platform-atmelavr/misc/svd/attiny841.svd
<device>
  <vendor>Atmel</vendor>
  <name>ATtiny841</name>
  <addressUnitBits>8</addressUnitBits>
  <size>8</size>
  <access>read-write</access>
  <resetValue>0</resetValue>
  <resetMask>0xff</resetMask>
  <peripherals>
    <peripheral>
      <name>AC</name>
      <description>Analog Comparator</description>
      <baseAddress>0x2A</baseAddress>
      <registers>
        <register>
          <name>ACSR0A</name>
          <description>Analog Comparator 0 Control And Status Register A</description>
          <addressOffset>0x0</addressOffset>
          <access>read-write</access><fields>
            <field>
              <name>ACIS0</name>
              <description>Analog Comparator Interrupt Mode Select</description>
              <bitRange>[1:0]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues><name>ACIS0</name><usage>read-write</usage><enumeratedValue><name>ON_TOGGLE</name><description>Interrupt on Toggle</description><value>0</value></enumeratedValue><enumeratedValue><name>ON_FALLING_EDGE</name><description>Interrupt on Falling Edge</description><value>2</value></enumeratedValue><enumeratedValue><name>ON_RISING_EDGE</name><description>Interrupt on Rising Edge</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ACIC0</name>
              <description>Analog Comparator 0 Input Capture Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ACIE0</name>
              <description>Analog Comparator 0 Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ACI0</name>
              <description>Analog Comparator 0 Interrupt Flag</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ACO0</name>
              <description>Analog Comparator 0 Output</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ACPMUX2</name>
              <description>Analog Comparator 0 Positive Input Multiplexer Bit 2</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ACD0</name>
              <description>Analog Comparator 0 Disable</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACSR0B</name>
          <description>Analog Comparator 0 Control And Status Register B</description>
          <addressOffset>0x1</addressOffset>
          <fields>
            <field>
              <name>ACPMUX</name>
              <description>Analog Comparator 0 Positive Input Multiplexer Bits 1:0</description>
              <bitRange>[1:0]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ACNMUX</name>
              <description>Analog Comparator 0 Negative Input Multiplexer</description>
              <bitRange>[3:2]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ACOE0</name>
              <description>Analog Comparator 0 Output Pin Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>HLEV0</name>
              <description>Analog Comparator 0 Hysteresis Level</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>HSEL0</name>
              <description>Analog Comparator 0 Hysteresis Select</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACSR1A</name>
          <description>Analog Comparator 1 Control And Status Register A</description>
          <addressOffset>0x2</addressOffset>
          <access>read-write</access><fields>
            <field>
              <name>ACIS1</name>
              <description>Analog Comparator Interrupt Mode Select</description>
              <bitRange>[1:0]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues><name>ACIS1</name><usage>read-write</usage><enumeratedValue><name>ON_TOGGLE</name><description>Interrupt on Toggle</description><value>0</value></enumeratedValue><enumeratedValue><name>ON_FALLING_EDGE</name><description>Interrupt on Falling Edge</description><value>2</value></enumeratedValue><enumeratedValue><name>ON_RISING_EDGE</name><description>Interrupt on Rising Edge</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ACIC1</name>
              <description>Analog Comparator 1 Input Capture Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ACIE1</name>
              <description>Analog Comparator 1 Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ACI1</name>
              <description>Analog Comparator 1 Interrupt Flag</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ACO1</name>
              <description>Analog Comparator 1 Output</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ACBG1</name>
              <description>Analog Comparator 1 Bandgap Select</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ACD1</name>
              <description>Analog Comparator 1 Disable</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACSR1B</name>
          <description>Analog Comparator 1 Control And Status Register B</description>
          <addressOffset>0x3</addressOffset>
          <fields>
            <field>
              <name>ACME1</name>
              <description>Analog Comparator 1 Multiplexer Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ACOE1</name>
              <description>Analog Comparator 1 Output Pin Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>HLEV1</name>
              <description>Analog Comparator 1 Hysteresis Level</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>HSEL1</name>
              <description>Analog Comparator 1 Hysteresis Select</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
