platformio/platform-atmelavr/misc/svd/attiny841.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ADC</name>
      <description>Analog-to-Digital Converter</description>
      <baseAddress>0x24</baseAddress>
      <registers>
        <register>
          <name>ADC</name>
          <description>ADC Data Register  Bytes</description>
          <addressOffset>0x2</addressOffset>
          <size>16</size>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>ADCSRA</name>
          <description>The ADC Control and Status register</description>
          <addressOffset>0x1</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADPS</name>
              <description>ADC Prescaler Select Bits</description>
              <bitRange>[2:0]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues><name>ADPS</name><usage>read-write</usage><enumeratedValue><name>PRESCALER_2</name><description>Prescaler Value 2</description><value>1</value></enumeratedValue><enumeratedValue><name>PRESCALER_4</name><description>Prescaler Value 4</description><value>2</value></enumeratedValue><enumeratedValue><name>PRESCALER_8</name><description>Prescaler Value 8</description><value>3</value></enumeratedValue><enumeratedValue><name>PRESCALER_16</name><description>Prescaler Value 16</description><value>4</value></enumeratedValue><enumeratedValue><name>PRESCALER_32</name><description>Prescaler Value 32</description><value>5</value></enumeratedValue><enumeratedValue><name>PRESCALER_64</name><description>Prescaler Value 64</description><value>6</value></enumeratedValue><enumeratedValue><name>PRESCALER_128</name><description>Prescaler Value 128</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ADIE</name>
              <description>ADC Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ADIF</name>
              <description>ADC Interrupt Flag</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADATE</name>
              <description>ADC Auto Trigger Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ADSC</name>
              <description>ADC Start Conversion</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ADEN</name>
              <description>ADC Enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCSRB</name>
          <description>ADC Control and Status Register B</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>ADTS</name>
              <description>ADC Auto Trigger Sources</description>
              <bitRange>[2:0]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VAL_0x00</name>
                  <description>Free Running mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x01</name>
                  <description>Analog Comparator 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x02</name>
                  <description>External Interrupt Request 0</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x03</name>
                  <description>Timer/Counter0 Compare Match A</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x04</name>
                  <description>Timer/Counter0 Overflow</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x05</name>
                  <description>Timer/Counter1 Compare Match A</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x06</name>
                  <description>Timer/Counter1 Overflow</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x07</name>
                  <description>Timer/Counter1 Capture Event</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADLAR</name>
              <description>&lt;TBD&gt;</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADMUXA</name>
          <description>The ADC multiplexer Selection Register A</description>
          <addressOffset>0x5</addressOffset>
          <fields>
            <field>
              <name>MUX</name>
              <description>Analog Channel and Gain Selection Bits</description>
              <bitRange>[5:0]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ADMUXB</name>
          <description>The ADC multiplexer Selection Register B</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>GSEL</name>
              <description>Gain Selection Bits</description>
              <bitRange>[1:0]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>REFS</name>
              <description>Reference Selection Bits</description>
              <bitRange>[7:5]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            <enumeratedValues><name>REFS</name><usage>read-write</usage><enumeratedValue><name>VCC</name><description>Vcc</description><value>0</value></enumeratedValue><enumeratedValue><name>INTERNAL_1</name><description>Internal 1.1V Voltage Reference with AREF disconnected</description><value>1</value></enumeratedValue><enumeratedValue><name>INTERNAL_2</name><description>Internal 2.2V Voltage Reference with AREF disconnected</description><value>2</value></enumeratedValue><enumeratedValue><name>INTERNAL_4</name><description>Internal 4.096V Voltage Reference with AREF disconnected</description><value>3</value></enumeratedValue><enumeratedValue><name>AREF</name><description>AREF with internal reference off</description><value>4</value></enumeratedValue><enumeratedValue><name>AREF_INTERNAL_1</name><description>Internal 1.1V Voltage Reference with external capacitor at AREF pin</description><value>5</value></enumeratedValue><enumeratedValue><name>AREF_INTERNAL_2</name><description>Internal 2.2V Voltage Reference with external capacitor at AREF pin</description><value>6</value></enumeratedValue><enumeratedValue><name>AREF_INTERNAL_4</name><description>Internal 4.096V Voltage Reference with external capacitor at AREF pin</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DIDR0</name>
          <description>Digital Input Disable Register 0</description>
          <addressOffset>0x3C</addressOffset>
          <fields>
            <field>
              <name>ADC0D</name>
              <description>ADC0/AREF Digital input Disable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADC1D</name>
              <description>ADC1/AIN00 Digital input Disable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADC2D</name>
              <description>ADC2/AIN01 Digital input Disable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADC3D</name>
              <description>ADC3/AIN10 Digital Input Disable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ADC4D</name>
              <description>ADC4/AIN11 Digital input Disable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADC5D</name>
              <description>ADC5 Digital input Disable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ADC6D</name>
              <description>ADC6 Digital input Disable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ADC7D</name>
              <description>ADC7 Digital input Disable</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DIDR1</name>
          <description>Digital Input Disable Register 1</description>
          <addressOffset>0x3D</addressOffset>
          <fields>
            <field>
              <name>ADC11D</name>
              <description>ADC11 Digital input Disable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADC10D</name>
              <description>ADC10 Digital input Disable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADC8D</name>
              <description>ADC8 Digital input Disable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADC9D</name>
              <description>ADC9 Digital Input Disable</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
