platformio/platform-atmelavr/misc/svd/attiny841.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>FUSE</name>
      <description>Fuses</description>
      <baseAddress>0x0</baseAddress>
      <registers>
        <register>
          <name>EXTENDED</name>
          <description>&lt;TBD&gt;</description>
          <addressOffset>0x2</addressOffset>
          <fields>
            <field>
              <name>SELFPRGEN</name>
              <description>Self Programming enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>BODACT</name>
              <description>BOD mode of operation when the device is active or idle</description>
              <bitRange>[2:1]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BOD_SAMPLED</name>
                  <description>Sampled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOD_ENABLED</name>
                  <description>Enabled</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOD_DISABLED</name>
                  <description>Disabled</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BODPD</name>
              <description>BOD mode of operation when the device is in sleep mode</description>
              <bitRange>[4:3]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BOD_SAMPLED</name>
                  <description>Sampled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOD_ENABLED</name>
                  <description>Enabled</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOD_DISABLED</name>
                  <description>Disabled</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ULPOSCSEL</name>
              <description>Frequency selection for internal ULP oscillator. The selection only affects system clock, watchdog and reset timeout always use 32 kHz clock.</description>
              <bitRange>[7:5]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ULPOSC_512KHZ</name>
                  <description>512 kHz</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULPOSC_256KHZ</name>
                  <description>256 kHz</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULPOSC_128KHZ</name>
                  <description>128 kHz</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULPOSC_64KHZ</name>
                  <description>64 kHz</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULPOSC_32KHZ</name>
                  <description>32 kHz</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HIGH</name>
          <description>&lt;TBD&gt;</description>
          <addressOffset>0x1</addressOffset>
          <fields>
            <field>
              <name>BODLEVEL</name>
              <description>Brown-out Detector trigger level</description>
              <bitRange>[2:0]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>4V3</name>
                  <description>Brown-out detection at VCC=4.3 V</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2V7</name>
                  <description>Brown-out detection at VCC=2.7 V</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1V8</name>
                  <description>Brown-out detection at VCC=1.8 V</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EESAVE</name>
              <description>Preserve EEPROM through the Chip Erase cycle</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>WDTON</name>
              <description>Watch-dog Timer always on</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SPIEN</name>
              <description>Serial program downloading (SPI) enabled</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>DWEN</name>
              <description>Debug Wire enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RSTDISBL</name>
              <description>Reset Disabled (Enable PC2 as i/o pin)</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LOW</name>
          <description>&lt;TBD&gt;</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>SUT_CKSEL</name>
              <description>Select Clock Source</description>
              <bitRange>[4:0]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXTCLK_6CK_16CK_16MS</name>
                  <description>Ext. Clock; Start-up time PWRDWN/RESET: 6 CK/16 CK + 16 ms</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTRCOSC_8MHZ_6CK_16CK_16MS</name>
                  <description>Int. RC Osc. 8 MHz; Start-up time PWRDWN/RESET: 6 CK/16 CK + 16 ms</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTULPOSC_32KHZ_6CK_16CK_16MS</name>
                  <description>Int. ULP Osc.; Start-up time PWRDWN/RESET: 6 CK/16 CK + 16 ms</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTLOFXTAL_1KCK_16CK_16MS</name>
                  <description>Ext. Low-Freq. Crystal; Start-up time PWRDWN/RESET: 1K CK/16 CK + 16 ms</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTCRES_0MHZ4_0MHZ9_258CK_16CK_16MS</name>
                  <description>Ext. Ceramic Res. 0.4-0.9 MHz; Start-up time PWRDWN/RESET: 258 CK/16 CK + 16 ms</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ4_0MHZ9_16KCK_16CK_16MS</name>
                  <description>Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time PWRDWN/RESET: 16 K CK/16 CK + 16 ms</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTCRES_0MHZ9_3MHZ_258CK_16CK_16MS</name>
                  <description>Ext. Ceramic Res. 0.9-3.0 MHz; Start-up time PWRDWN/RESET: 258 CK/16 CK + 16 ms</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ9_3MHZ_16KCK_16CK_16MS</name>
                  <description>Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time PWRDWN/RESET: 16 K CK/16 CK + 16 ms</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTCRES_3MHZ_8MHZ_258CK_16CK_16MS</name>
                  <description>Ext. Ceramic Res. 3.0-8.0 MHz; Start-up time PWRDWN/RESET: 258 CK/16 CK + 16 ms</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_3MHZ_8MHZ_16KCK_16CK_16MS</name>
                  <description>Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time PWRDWN/RESET: 16 K CK/16 CK + 16 ms</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTCRES_8MHZ_XX_258CK_16CK_16MS</name>
                  <description>Ext. Ceramic Res. 8.0- MHz; Start-up time PWRDWN/RESET: 258 CK/16 CK + 16 ms</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_8MHZ_XX_16KCK_16CK_16MS</name>
                  <description>Ext. Crystal Osc. 8.0- MHz; Start-up time PWRDWN/RESET: 16 K CK/16 CK + 16 ms</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTLOFXTAL_32KCK_14CK_16MS</name>
                  <description>Ext. Low-Freq. Crystal; Start-up time PWRDWN/RESET: 32K CK/16 CK + 16 ms</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTCRES_0MHZ4_0MHZ9_1KCK_16CK_16MS</name>
                  <description>Ext. Ceramic Res. 0.4-0.9 MHz; Start-up time PWRDWN/RESET: 1K CK/16 CK + 16 ms</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTCRES_0MHZ9_3MHZ_1KCK_16CK_16MS</name>
                  <description>Ext. Ceramic Res. 0.9-3.0 MHz; Start-up time PWRDWN/RESET: 1K CK/16 CK + 16 ms</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTCRES_3MHZ_8MHZ_1KCK_16CK_16MS</name>
                  <description>Ext. Ceramic Res. 3.0-8.0 MHz; Start-up time PWRDWN/RESET: 1K CK/16 CK + 16 ms</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTCRES_8MHZ_XX_1KCK_16CK_16MS</name>
                  <description>Ext. Ceramic Res. 8.0- MHz; Start-up time PWRDWN/RESET: 1K CK/16 CK + 16 ms</description>
                  <value>30</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CKOUT</name>
              <description>Clock output on PORTC2</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CKDIV8</name>
              <description>Divide clock by 8 internally</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
