platformio/platform-atmelavr/misc/svd/attiny841.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TC1</name>
      <description>Timer/Counter1, 16-bit</description>
      <baseAddress>0x2E</baseAddress>
      <registers>
        <register>
          <name>GTCCR</name>
          <description>General Timer/Counter Control Register</description>
          <addressOffset>0x15</addressOffset>
          <fields>
            <field>
              <name>PSR</name>
              <description>Prescaler Reset Timer/CounterN</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TSM</name>
              <description>Timer/Counter Synchronization Mode</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR1</name>
          <description>Timer/Counter1 Input Capture Register  Bytes</description>
          <addressOffset>0x16</addressOffset>
          <size>16</size>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>OCR1A</name>
          <description>Timer/Counter1 Output Compare Register A  Bytes</description>
          <addressOffset>0x1C</addressOffset>
          <size>16</size>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>OCR1B</name>
          <description>Timer/Counter1 Output Compare Register B  Bytes</description>
          <addressOffset>0x1A</addressOffset>
          <size>16</size>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>TCCR1A</name>
          <description>Timer/Counter1 Control Register A</description>
          <addressOffset>0x21</addressOffset>
          <fields>
            <field>
              <name>WGM1</name>
              <description>Pulse Width Modulator Select Bits</description>
              <bitRange>[1:0]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>COM1B</name>
              <description>Compare Output Mode 1B, bits</description>
              <bitRange>[5:4]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues></writeConstraint>
            <enumeratedValues><name>COM1B</name><usage>read-write</usage><enumeratedValue><name>DISCONNECTED</name><description>Normal port operation, OCix disconnected</description><value>0</value></enumeratedValue><enumeratedValue><name>MATCH_TOGGLE</name><description>Toggle OCix on Compare Match (Might depend on WGM)</description><value>1</value></enumeratedValue><enumeratedValue><name>MATCH_CLEAR</name><description>Clear OCix on Compare Match (If PWM is enabled, OCix is set at BOTTOM)</description><value>2</value></enumeratedValue><enumeratedValue><name>MATCH_SET</name><description>Set OCix on Compare Match (If PWM is enabled, OCix is cleared at BOTTOM)</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>COM1A</name>
              <description>Compare Output Mode 1A, bits</description>
              <bitRange>[7:6]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues></writeConstraint>
            <enumeratedValues derivedFrom="COM1B" />
            </field>
          </fields>
        </register>
        <register>
          <name>TCCR1B</name>
          <description>Timer/Counter1 Control Register B</description>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>CS1</name>
              <description>Clock Select bits</description>
              <bitRange>[2:0]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues></writeConstraint>
              <enumeratedValues><name>CS1</name><usage>read-write</usage><enumeratedValue><name>NO_CLOCK</name><description>No clock source (Timer/Counter stopped)</description><value>0</value></enumeratedValue><enumeratedValue><name>DIRECT</name><description>Running, No Prescaling</description><value>1</value></enumeratedValue><enumeratedValue><name>PRESCALE_8</name><description>Running, CLK/8</description><value>2</value></enumeratedValue><enumeratedValue><name>PRESCALE_64</name><description>Running, CLK/64</description><value>3</value></enumeratedValue><enumeratedValue><name>PRESCALE_256</name><description>Running, CLK/256</description><value>4</value></enumeratedValue><enumeratedValue><name>PRESCALE_1024</name><description>Running, CLK/1024</description><value>5</value></enumeratedValue><enumeratedValue><name>EXT_FALLING</name><description>Running, ExtClk Tx Falling Edge</description><value>6</value></enumeratedValue><enumeratedValue><name>EXT_RISING</name><description>Running, ExtClk Tx Rising Edge</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>WGM1</name>
              <description>Waveform Generation Mode Bits</description>
              <bitRange>[4:3]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ICES1</name>
              <description>Input Capture 1 Edge Select</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ICNC1</name>
              <description>Input Capture 1 Noise Canceler</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TCCR1C</name>
          <description>Timer/Counter1 Control Register C</description>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>FOC1B</name>
              <description>Force Output Compare for Channel B</description>
              <bitRange>[6:6]</bitRange>
            <access>write-only</access></field>
            <field>
              <name>FOC1A</name>
              <description>Force Output Compare for Channel A</description>
              <bitRange>[7:7]</bitRange>
            <access>write-only</access></field>
          </fields>
        </register>
        <register>
          <name>TCNT1</name>
          <description>Timer/Counter1  Bytes</description>
          <addressOffset>0x1E</addressOffset>
          <size>16</size>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>TIFR1</name>
          <description>Timer/Counter Interrupt Flag register</description>
          <addressOffset>0x0</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>TOV1</name>
              <description>Timer/Counter1 Overflow Flag</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>OCF1A</name>
              <description>Timer/Counter1 Output Compare A Match Flag</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>OCF1B</name>
              <description>Timer/Counter1 Output Compare B Match Flag</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ICF1</name>
              <description>Timer/Counter1 Input Capture Flag</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMSK1</name>
          <description>Timer/Counter1 Interrupt Mask Register</description>
          <addressOffset>0x1</addressOffset>
          <fields>
            <field>
              <name>TOIE1</name>
              <description>Timer/Counter1 Overflow Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>OCIE1A</name>
              <description>Timer/Counter1 Output Compare A Match Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>OCIE1B</name>
              <description>Timer/Counter1 Output Compare B Match Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ICIE1</name>
              <description>Timer/Counter1 Input Capture Interrupt Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
