platformio/platform-atmelavr/misc/svd/attiny841.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TOCPM</name>
      <description>Timer/Counter Output Compare Pin</description>
      <baseAddress>0x66</baseAddress>
      <registers>
        <register>
          <name>TOCPMCOE</name>
          <description>Timer Output Compare Pin Mux Channel Output Enable</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>TOCC0OE</name>
              <description>Timer Output Compare Channel 0 Output Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TOCC1OE</name>
              <description>Timer Output Compare Channel 1 Output Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TOCC2OE</name>
              <description>Timer Output Compare Channel 2 Output Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TOCC3OE</name>
              <description>Timer Output Compare Channel 3 Output Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TOCC4OE</name>
              <description>Timer Output Compare Channel 4 Output Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TOCC5OE</name>
              <description>Timer Output Compare Channel 5 Output Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TOCC6OE</name>
              <description>Timer Output Compare Channel 6 Output Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TOCC7OE</name>
              <description>Timer Output Compare Channel 7 Output Enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TOCPMSA0</name>
          <description>Timer Output Compare Pin Mux Selection 0</description>
          <addressOffset>0x1</addressOffset>
          <fields>
            <field>
              <name>TOCC0S</name>
              <description>Timer Output Compare Channel 0 Selection Bits</description>
              <bitRange>[1:0]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TOCC1S</name>
              <description>Timer Output Compare Channel 1 Selection Bits</description>
              <bitRange>[3:2]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TOCC2S</name>
              <description>Timer Output Compare Channel 2 Selection Bits</description>
              <bitRange>[5:4]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TOCC3S</name>
              <description>Timer Output Compare Channel 3 Selection Bits</description>
              <bitRange>[7:6]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TOCPMSA1</name>
          <description>Timer Output Compare Pin Mux Selection 1</description>
          <addressOffset>0x2</addressOffset>
          <fields>
            <field>
              <name>TOCC4S</name>
              <description>Timer Output Compare Channel 4 Selection Bits</description>
              <bitRange>[1:0]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TOCC5S</name>
              <description>Timer Output Compare Channel 5 Selection Bits</description>
              <bitRange>[3:2]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TOCC6S</name>
              <description>Timer Output Compare Channel 6 Selection Bits</description>
              <bitRange>[5:4]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TOCC7S</name>
              <description>Timer Output Compare Channel 7 Selection Bits</description>
              <bitRange>[7:6]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>TWI</name>
      <description>Two Wire Serial Interface</description>
      <baseAddress>0xA0</baseAddress>
      <registers>
        <register>
          <name>TWSA</name>
          <description>TWI Slave Address Register</description>
          <addressOffset>0x2</addressOffset>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>TWSAM</name>
          <description>TWI Slave Address Mask Register</description>
          <addressOffset>0x1</addressOffset>
          <fields>
            <field>
              <name>TWAE</name>
              <description>TWI Address Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TWSAM</name>
              <description>TWI Address Mask Bits</description>
              <bitRange>[7:1]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TWSCRA</name>
          <description>TWI Slave Control Register A</description>
          <addressOffset>0x5</addressOffset>
          <fields>
            <field>
              <name>TWSME</name>
              <description>TWI Smart Mode Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TWPME</name>
              <description>TWI Promiscuous Mode Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TWSIE</name>
              <description>TWI Stop Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TWEN</name>
              <description>Two-Wire Interface Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TWASIE</name>
              <description>TWI Address/Stop Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TWDIE</name>
              <description>TWI Data Interrupt Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TWSHE</name>
              <description>TWI SDA Hold Time Enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TWSCRB</name>
          <description>TWI Slave Control Register B</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>TWCMD</name>
              <description>&lt;TBD&gt;</description>
              <bitRange>[1:0]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TWAA</name>
              <description>TWI Acknowledge Action</description>
              <bitRange>[2:2]</bitRange>
            <enumeratedValues><name>TWAA</name><usage>read-write</usage><enumeratedValue><name>ACK_WRITE</name><description>Send ACK when TWCMD is written as 10 or 11</description><value>0</value></enumeratedValue><enumeratedValue><name>ACK_READ</name><description>Send ACK when TWSD is read</description><value>1</value></enumeratedValue><enumeratedValue><name>NACK_WRITE</name><description>Send NACK when TWCMD is written as 10 or 11</description><value>2</value></enumeratedValue><enumeratedValue><name>NACK_READ</name><description>Send NACK when TWSD is read</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TWHNM</name>
              <description>TWI High Noise Mode</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TWSD</name>
          <description>TWI Slave Data Register</description>
          <addressOffset>0x0</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>TWSD</name>
              <description>TWI slave data bit</description>
              <bitRange>[7:0]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TWSSRA</name>
          <description>TWI Slave Status Register A</description>
          <addressOffset>0x3</addressOffset>
          <fields>
            <field>
              <name>TWAS</name>
              <description>TWI Address or Stop</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TWDIR</name>
              <description>TWI Read/Write Direction</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TWBE</name>
              <description>TWI Bus Error</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TWC</name>
              <description>TWI Collision</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TWRA</name>
              <description>TWI Receive Acknowledge</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TWCH</name>
              <description>TWI Clock Hold</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TWASIF</name>
              <description>TWI Address/Stop Interrupt Flag</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TWDIF</name>
              <description>TWI Data Interrupt Flag.</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
