platformio/platform-atmelavr/misc/svd/attiny841.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>USART0</name>
      <description>USART</description>
      <baseAddress>0x65</baseAddress>
      <registers>
        <register>
          <name>REMAP</name>
          <description>Remap Port Pins</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>U0MAP</name>
              <description>USART0 Pin Mapping</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>UBRR0</name>
          <description>USART Baud Rate Register Bytes</description>
          <addressOffset>0x1C</addressOffset>
          <size>16</size>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>UCSR0A</name>
          <description>USART Control and Status Register A</description>
          <addressOffset>0x21</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>MPCM0</name>
              <description>Multi-processor Communication Mode</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>U2X0</name>
              <description>Double the USART transmission speed</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>UPE0</name>
              <description>Parity Error</description>
              <bitRange>[2:2]</bitRange>
            <access>read-only</access></field>
            <field>
              <name>DOR0</name>
              <description>Data overRun</description>
              <bitRange>[3:3]</bitRange>
            <access>read-only</access></field>
            <field>
              <name>FE0</name>
              <description>Framing Error</description>
              <bitRange>[4:4]</bitRange>
            <access>read-only</access></field>
            <field>
              <name>UDRE0</name>
              <description>USART Data Register Empty</description>
              <bitRange>[5:5]</bitRange>
            <access>read-only</access></field>
            <field>
              <name>TXC0</name>
              <description>USART Transmit Complete</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RXC0</name>
              <description>USART Receive Complete</description>
              <bitRange>[7:7]</bitRange>
            <access>read-only</access></field>
          </fields>
        </register>
        <register>
          <name>UCSR0B</name>
          <description>USART Control and Status Register B</description>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>TXB80</name>
              <description>Transmit Data Bit 8</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RXB80</name>
              <description>Receive Data Bit 8</description>
              <bitRange>[1:1]</bitRange>
            <access>read-only</access></field>
            <field>
              <name>UCSZ02</name>
              <description>Character Size</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TXEN0</name>
              <description>Transmitter Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RXEN0</name>
              <description>Receiver Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>UDRIE0</name>
              <description>USART Data register Empty Interrupt Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TXCIE0</name>
              <description>TX Complete Interrupt Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RXCIE0</name>
              <description>RX Complete Interrupt Enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>UCSR0C</name>
          <description>USART Control and Status Register C</description>
          <addressOffset>0x1F</addressOffset>
          <fields>
            <field>
              <name>UCPOL0</name>
              <description>Clock Polarity</description>
              <bitRange>[0:0]</bitRange>
            <enumeratedValues><name>UCPOL0</name><usage>read-write</usage><enumeratedValue><name>RISING_EDGE</name><description>Transmit on Rising XCKn Edge, Receive on Falling XCKn Edge</description><value>0</value></enumeratedValue><enumeratedValue><name>FALLING_EDGE</name><description>Transmit on Falling XCKn Edge, Receive on Rising XCKn Edge</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>UCSZ0</name>
              <description>Character Size</description>
              <bitRange>[2:1]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            <enumeratedValues><name>UCSZ0</name><usage>read-write</usage><enumeratedValue><name>CHR5</name><description>Character Size: 5 bit</description><value>0</value></enumeratedValue><enumeratedValue><name>CHR6</name><description>Character Size: 6 bit</description><value>1</value></enumeratedValue><enumeratedValue><name>CHR7</name><description>Character Size: 7 bit</description><value>2</value></enumeratedValue><enumeratedValue><name>CHR8</name><description>Character Size: 8 bit</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>USBS0</name>
              <description>Stop Bit Select</description>
              <bitRange>[3:3]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues><name>USBS0</name><usage>read-write</usage><enumeratedValue><name>STOP1</name><description>1-bit</description><value>0</value></enumeratedValue><enumeratedValue><name>STOP2</name><description>2-bit</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>UPM0</name>
              <description>Parity Mode Bits</description>
              <bitRange>[5:4]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues><name>UPM0</name><usage>read-write</usage><enumeratedValue><name>DISABLED</name><description>Disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>PARITY_EVEN</name><description>Enabled, Even Parity</description><value>2</value></enumeratedValue><enumeratedValue><name>PARITY_ODD</name><description>Enabled, Odd Parity</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>UMSEL0</name>
              <description>USART Mode Select</description>
              <bitRange>[7:6]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues><name>UMSEL0</name><usage>read-write</usage><enumeratedValue><name>USART_ASYNC</name><description>Asynchronous USART</description><value>0</value></enumeratedValue><enumeratedValue><name>USART_SYNC</name><description>Synchronous USART</description><value>1</value></enumeratedValue><enumeratedValue><name>SPI_MASTER</name><description>Master SPI (MSPIM)</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UCSR0D</name>
          <description>USART Control and Status Register D</description>
          <addressOffset>0x1E</addressOffset>
          <fields>
            <field>
              <name>SFDE0</name>
              <description>USART RX Start Frame Detection Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RXS0</name>
              <description>USART RX Start Flag</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RXSIE0</name>
              <description>USART RX Start Interrupt Enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>UDR0</name>
          <description>USART I/O Data Register</description>
          <addressOffset>0x1B</addressOffset>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
