platformio/platform-atmelavr/misc/svd/attiny841.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>USART1</name>
      <description>USART</description>
      <baseAddress>0x90</baseAddress>
      <registers>
        <register>
          <name>UBRR1</name>
          <description>USART Baud Rate Register Bytes</description>
          <addressOffset>0x1</addressOffset>
          <size>16</size>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>UCSR1A</name>
          <description>USART Control and Status Register A</description>
          <addressOffset>0x6</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>MPCM1</name>
              <description>Multi-processor Communication Mode</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>U2X1</name>
              <description>Double the USART transmission speed</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>UPE1</name>
              <description>Parity Error</description>
              <bitRange>[2:2]</bitRange>
            <access>read-only</access></field>
            <field>
              <name>DOR1</name>
              <description>Data overRun</description>
              <bitRange>[3:3]</bitRange>
            <access>read-only</access></field>
            <field>
              <name>FE1</name>
              <description>Framing Error</description>
              <bitRange>[4:4]</bitRange>
            <access>read-only</access></field>
            <field>
              <name>UDRE1</name>
              <description>USART Data Register Empty</description>
              <bitRange>[5:5]</bitRange>
            <access>read-only</access></field>
            <field>
              <name>TXC1</name>
              <description>USART Transmit Complete</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RXC1</name>
              <description>USART Receive Complete</description>
              <bitRange>[7:7]</bitRange>
            <access>read-only</access></field>
          </fields>
        </register>
        <register>
          <name>UCSR1B</name>
          <description>USART Control and Status Register B</description>
          <addressOffset>0x5</addressOffset>
          <fields>
            <field>
              <name>TXB81</name>
              <description>Transmit Data Bit 8</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RXB81</name>
              <description>Receive Data Bit 8</description>
              <bitRange>[1:1]</bitRange>
            <access>read-only</access></field>
            <field>
              <name>UCSZ12</name>
              <description>Character Size</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TXEN1</name>
              <description>Transmitter Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RXEN1</name>
              <description>Receiver Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>UDRIE1</name>
              <description>USART Data register Empty Interrupt Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TXCIE1</name>
              <description>TX Complete Interrupt Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RXCIE1</name>
              <description>RX Complete Interrupt Enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>UCSR1C</name>
          <description>USART Control and Status Register C</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>UCPOL1</name>
              <description>Clock Polarity</description>
              <bitRange>[0:0]</bitRange>
            <enumeratedValues><name>UCPOL1</name><usage>read-write</usage><enumeratedValue><name>RISING_EDGE</name><description>Transmit on Rising XCKn Edge, Receive on Falling XCKn Edge</description><value>0</value></enumeratedValue><enumeratedValue><name>FALLING_EDGE</name><description>Transmit on Falling XCKn Edge, Receive on Rising XCKn Edge</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>UCSZ1</name>
              <description>Character Size</description>
              <bitRange>[2:1]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            <enumeratedValues><name>UCSZ1</name><usage>read-write</usage><enumeratedValue><name>CHR5</name><description>Character Size: 5 bit</description><value>0</value></enumeratedValue><enumeratedValue><name>CHR6</name><description>Character Size: 6 bit</description><value>1</value></enumeratedValue><enumeratedValue><name>CHR7</name><description>Character Size: 7 bit</description><value>2</value></enumeratedValue><enumeratedValue><name>CHR8</name><description>Character Size: 8 bit</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>USBS1</name>
              <description>Stop Bit Select</description>
              <bitRange>[3:3]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues><name>USBS1</name><usage>read-write</usage><enumeratedValue><name>STOP1</name><description>1-bit</description><value>0</value></enumeratedValue><enumeratedValue><name>STOP2</name><description>2-bit</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>UPM1</name>
              <description>Parity Mode Bits</description>
              <bitRange>[5:4]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues><name>UPM1</name><usage>read-write</usage><enumeratedValue><name>DISABLED</name><description>Disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>PARITY_EVEN</name><description>Enabled, Even Parity</description><value>2</value></enumeratedValue><enumeratedValue><name>PARITY_ODD</name><description>Enabled, Odd Parity</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>UMSEL1</name>
              <description>USART Mode Select</description>
              <bitRange>[7:6]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues><name>UMSEL1</name><usage>read-write</usage><enumeratedValue><name>USART_ASYNC</name><description>Asynchronous USART</description><value>0</value></enumeratedValue><enumeratedValue><name>USART_SYNC</name><description>Synchronous USART</description><value>1</value></enumeratedValue><enumeratedValue><name>SPI_MASTER</name><description>Master SPI (MSPIM)</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UCSR1D</name>
          <description>USART Control and Status Register D</description>
          <addressOffset>0x3</addressOffset>
          <fields>
            <field>
              <name>SFDE1</name>
              <description>USART RX Start Frame Detection Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RXS1</name>
              <description>USART RX Start Flag</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RXSIE1</name>
              <description>USART RX Start Interrupt Enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>UDR1</name>
          <description>USART I/O Data Register</description>
          <addressOffset>0x0</addressOffset>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
